app/controllers/listings_controller.rb

  def index
    @listings = Listing.all
---
SELECT "listings".* FROM "listings"

  def create
    @listing = Listing.new(listing_params)

    respond_to do |format|
      if @listing.save
---
INSERT INTO "listings" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-09-07 01:54:27.251562"], ["description", ""], ["name", ""], ["updated_at", "2014-09-07 01:54:27.251562"]]

  def update
    respond_to do |format|
      if @listing.update(listing_params)
---
UPDATE "listings" SET "image_file_name" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "listings"."id" = 7  [["image_file_name", "Golf.jpg"], ["image_updated_at", "2014-09-17 03:57:04.516620"], ["updated_at", "2014-09-17 03:57:05.009472"]]

  def destroy
    @listing.destroy
---
DELETE FROM "listings" WHERE "listings"."id" = ?  [["id", 1]]

    def set_listing
      @listing = Listing.find(params[:id])
---
SELECT  "listings".* FROM "listings"  WHERE "listings"."id" = ? LIMIT 1  [["id", 3]]